In [1]:
import numpy as np
import pandas as pd

In [2]:
np.random.seed(101)

In [3]:
df = pd.DataFrame(np.random.randn(5,4), ["A","B","C","D","E"],["W","X","Y","Z"]) # data, row, columns

In [4]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [5]:
# conditional selection on pandas

In [13]:
df[df > 0] # [condition]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [ ]:
# selecting values based on a column?

In [20]:
result_df = df[df["W"]>0] # passing a a column between [] and the condition also []
# selecting items on column W greater than 0

In [19]:
df[df["Z"]<0] # selecting items that are less than 0 on column Z

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [ ]:
result_df

In [23]:
result_df["X"]

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [24]:
# in one step?

In [26]:
df[df["W"]>0]["X"] # stacking commands [conditional fomat][selecting a column]

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [29]:
df[df["W"]>0][["Y","X"]] # or picking 2 columns
# [conditional select][picking colmuns]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

In [30]:
# multiple conditions selection

In [33]:
df[(df["W"]>0) & (df["Y"]>1)]  # using & is an AND operator for multiple conditions at a time!

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [34]:
df[(df["W"]>0) | (df["Y"]>1)] # using | is an OR operator

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [36]:
# resetting your index count

In [37]:
df.reset_index() # index will become a column and index 0,1,2,3,4
# remember inplace = True to modify the dataframe

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [38]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [44]:
# adding new column to our df and set as our index

In [39]:
new_ind = "CA NY WY OR CO".split()

In [40]:
new_ind

['CA', 'NY', 'WY', 'OR', 'CO']

In [41]:
df["States"] = new_ind

In [42]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [43]:
df.set_index("States") # it will make a given column as our index value!

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509